Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-43-53.tmx
Source language: bo
Languages: en

source: བྱུང་བས་ཞིང་ཐམས་ཅད་ཀྱང་སྒྱུ་མའི་རྣམ་པར་མཐོང་ངོ་། །ཡེ་ཤེས་ཀྱིས་སྤོང་བའི་རྒྱུ་ལས་བརྟག་སྟེ། །བསྐྱེད་པས་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱང་སྒྱུ་མའི་རྣམ་པར་མཐོང་ངོ་།
en: “We see all śrāvakas and pratyeka­buddhas as the appearance of illusion because they arise from illusory analysis that has discarded wisdom.

source: །སྒྱུ་མར་མངོན་པར་བསྒྲུབ་པ་ལས་གྲུབ་སྟེ། སྤྲུལ་པའི་སྤྱོད་པ་དང་། འདུལ་བའི་སྒྱུ་མའི་རང་བཞིན་པས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་དང་། སྨོན་ལམ་གྱིས་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། འདུལ་བ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་ཡང་སྒྱུ་མའི་རྣམ་པ་ལྟ་བུར་ཤེས་སོ། །སྨོན་ལམ་དང་ཡེ་ཤེས་སྒྱུ་མས་མངོན་པར་བསྒྲུབས་ཏེ།
en: “We also know the successive ripening and guiding of beings through bodhisattva conduct and prayers to be like the appearance of illusions because they are accomplished as illusions having emanated conduct and guidance that have the nature of being illusions.

source: ཡུལ་བསམ་གྱིས་མི་ཁྱབ་པ་སྒྱུ་མའི་རང་བཞིན་ཡིན་པས་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་དཀྱིལ་འཁོར་ཡང་སྒྱུ་མར་མཐོང་ངོ་།
en: “We see the field of buddhas and bodhisattvas as the appearance of illusions, because it is accomplished through the illusion of prayers and wisdom and has the nature of being an illusory inconceivable range of perception.

source: །རིགས་ཀྱི་བུ་བདག་ཅག་གཉིས་ཀྱིས་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་བ་སྒྱུ་མའི་རང་བཞིན་འདི་ཤེས་པར་ཟད་ན།
en: “Noble one, the two of us know only this bodhisattva liberation called the appearance of illusion

source: ཁོ་བོ་ཅག་གིས་བྱང་ཆུབ་སེམས་དཔའ་ལས་སྒྱུ་མ་མཐའ་ཡས་པས་རྣམ་པར་བསྒྲུབས་པའི་དྲ་བ་ཁོང་དུ་ཆུད་པ་རྣམས་ཀྱི་སྤྱོད་པ་ཤེས་པའམ། ཡོན་ཏན་བརྗོད་པར་ནུས་རེ་སྐན།
en: How could we know the conduct or describe the qualities of the bodhisattvas who have realized the net of the accomplishment of infinite illusory activities?”

source: དེ་ནས་ཁྱེའུ་དཔལ་འབྱུང་བ་དང་། བུ་མོ་དཔལ་གྱི་བློ་གྲོས་མས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་དགེ་བའི་རྩ་བའི་ཤུགས་དྲག་པོ་བསམ་གྱིས་མི་ཁྱབ་པས་མངོན་པར་བརླན་ནས་རང་གི་རྣམ་པར་ཐར་པའི་ཡུལ་བསྟན་ཏེ། འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Then the boy Śrīsaṃbhava and the girl Śrīmati, through having saturated Sudhana, the head merchant’s son, with inconceivable, powerful roots of merit, and having taught him their own liberation, said, “Depart, noble one.

source: །སོང་རིགས་ཀྱི་བུ་ལྷོ་ཕྱོགས་ཀྱི་རྒྱུད་འདི་ཉིད་ཀྱི་ཕྱོགས་ཀྱི་སྒོའི་གནས་རྒྱ་མཚོའི་འགྲམ་ཞེས་བྱ་བ་དེ་ན་བཟའ་ཤིང་གི་ར་བ་རྒྱན་ཆེན་པོ་ཞེས་བྱ་བ་ཡོད་དེ།
en: In this southern region there is a great park called Mahāvyūha in a province called Samudrakaccha.

source: དེའི་ནང་ན་ཁང་པ་བརྩེགས་པ་ཆེན་པོ་རྣམ་པར་སྣང་མཛད་ཀྱི་རྒྱན་གྱིས་བརྒྱན་པའི་སྙིང་པོ་ཞེས་བྱ་བ་བྱང་ཆུབ་སེམས་དཔའི་དགེ་བའི་རྩ་བ་རྣམ་པར་སྨིན་པ་ལས་མངོན་པར་གྲུབ་པ།
en: Within it there is a great kūṭāgāra called Vairocana­vyūhālaṃkāra­garbha, which has been created by the ripening of a bodhisattva’s roots of merit.

source: བྱང་ཆུབ་སེམས་དཔའི་སེམས་དང་ཡིད་ལ་བྱ་བ་ལས་བྱུང་བ།
en: It has appeared from the mind and mentation of a bodhisattva.

source: བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་ལས་མངོན་པར་སྐྱེས་པ།
en: It has arisen from the prayers of a bodhisattva.

source: བྱང་ཆུབ་སེམས་དཔའི་དབང་ལས་བྱུང་བ།
en: It has appeared from the power of a bodhisattva.

source: བྱང་ཆུབ་སེམས་དཔའི་མངོན་པར་ཤེས་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་ཀྱིས་སྤྲུལ་བ།
en: It has been emanated by the power of the higher knowledge of a bodhisattva.

source: བྱང་ཆུབ་སེམས་དཔའི་ཐབས་མཁས་པ་ལས་བྱུང་བ།
en: It has appeared from the skillful methods of a bodhisattva.

source: བྱང་ཆུབ་སེམས་དཔའི་བསོད་ནམས་དང་ཡེ་ཤེས་ཀྱི་སྟོབས་ཀྱིས་རྫོགས་པ།
en: It has been perfected by the strength of the merit and knowledge of a bodhisattva.

source: བྱང་ཆུབ་སེམས་དཔའི་སྙིང་རྗེ་ཆེན་པོས་སེམས་ཅན་རྣམ་པར་གདུལ་བའི་དོན་དུ་བསྟན་པ།
en: It has manifested for the guiding of beings by the great compassion of a bodhisattva.

source: བྱང་ཆུབ་སེམས་དཔའི་བྱིན་གྱི་རླབས་རྣམ་པར་ཕྱེ་བས་བསྒྲུབས་པ།
en: It has been accomplished by the display of the blessing of a bodhisattva.

source: བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་བསམ་གྱིས་མི་ཁྱབ་པའི་གནས་ལ་འཇུག་པའི་རྒྱན་གྱིས་བརྒྱན་པ་ཡོད་དེ།
en: It is adorned by dwelling in the inconceivable state of bodhisattva liberation. Within it resides the bodhisattva mahāsattva Maitreya, in order to take into his care the humans who dwell on the level of birth;

source: དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་ཞེས་བྱ་བ་སྐྱེ་བའི་ས་ལ་གནས་པའི་མྱི་རྣམས་རྗེས་སུ་གཟུང་བ་དང་། ཕ་དང་མ་དང་གཉེན་དུ་གྱུར་པ་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། དེར་སྐྱེས་བའི་བྱང་ཆུབ་སེམས་དཔའ་སྐལ་བ་མཉམ་པ་རྣམས་ཀྱི་ཐེག་པ་ཆེན་པོ་རབ་ཏུ་བརྟན་པར་བྱ་བ་དང་། དེ་མ་ཡིན་པའི་སེམས་ཅན་གཞན་རྣམས་ཀྱང་གར་འོས་པའི་སར་དགེ་བའི་རྩ་བས་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། རང་གི་རྣམ་པར་ཐར་པའི་ཚུལ་ལ་འཇུག་པར་བྱ་བ་ཡོངས་སུ་བསྟན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་བ་ལ་དབང་བསྒྱུར་བ་ཐམས་ཅད་ཀྱི་རྗེས་སུ་སོང་བ་རབ་ཏུ་བརྗོད་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྐྱེ་བ་ཡོངས་སུ་བསྟན་པ་ལ་མངོན་པར་གཞོལ་བར་བྱ་བས་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་མི་གཏང་བ་དང་། འགྲོ་བ་ཐམས་ཅད་ཡོངས་སུ་གཟུང་བ་མི་སྨད་པས་བྱང་ཆུབ་སེམས་དཔའི་སྙིང་རྗེ་ཆེན་པོའི་སྟོབས་བསྟན་པར་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་གནས་གཞི་རྟེན་ཐམས་ཅད་ལས་གྱེན་དུ་འཕགས་པ་ཁོང་དུ་ཆུད་པར་བྱ་བ་དང་གནས་མེད་པ་ལ་གཞོལ་བར་སྲིད་པར་སྐྱེ་བ་ཐམས་ཅད་ན་གནས་པ་ཡོངས་སུ་བསྟན་པའི་དོན་དུ་འདུག་གིས།
en: in order to ripen fathers, mothers, and families; in order to make firm the Mahāyāna for bodhisattvas born there who have the corresponding conduct; in order to also ripen other beings with roots of merit according to their levels; in order to teach how to enter his own liberation; in order to describe how bodhisattvas with power over birth go everywhere intent on manifesting in the births of all beings in order not to forsake ripening beings; in order to generate the strength of the great compassion of a bodhisattva through not being inferior in caring for all beings; in order for bodhisattvas to realize rising up above all locations; and in order for them to manifest, without location, being located in all births in existences. “Go to him and ask him, ‘How should a bodhisattva inquire about bodhisattva conduct?

source: དེའི་གན་དུ་སོང་ལ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་ཡོངས་སུ་དྲི་བ་དང་། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་ལམ་ཡོངས་སུ་དག་པར་བྱ་བ་དང་། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་བསླབ་པ་ལ་ནན་ཏན་དུ་བྱ་བ་དང་། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་ཀྱི་སེམས་ཡོངས་སུ་སྦྱང་བར་བྱ་བ་དང་། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་མངོན་པར་བསྒྲུབ་པར་བྱ་བ་དང་། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཡོངས་སུ་བསགས་པར་བྱ་བ་དང་། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་ས་ཡོངས་སུ་གནོན་པར་བྱ་བ་དང་། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱ་བ་དང་། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་བཟོད་པ་ལ་འཇུག་པར་བྱ་བ་དང་། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་ནན་ཏན་གྱི་ཡོན་ཏན་ལ་གནས་པར་བྱ་བ་དང་། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་དགེ་བའི་བཤེས་གཉེན་བསྙེན་བཀུར་བར་བྱ་བ་དྲིས་ཤིག །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: How should a bodhisattva purify the bodhisattva path? How should a bodhisattva practice the bodhisattva training? How should a bodhisattva purify the aspiration to enlightenment? How should a bodhisattva accomplish bodhisattva prayers? How should a bodhisattva gather the bodhisattva accumulations?

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ་ཞེས་བྱ་བ་དེ་ནི།
en: How should a bodhisattva ascend the bodhisattva bhūmis?

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཐམས་ཅད་ལ་ཞུགས་པའོ། །དེ་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་དང་བསམ་པ་རྟོགས་པར་ཁོང་དུ་ཆུད་པའོ། །དེ་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྤྱོད་པའི་རྗེས་སུ་ཞུགས་པའོ། །དེ་ནི་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། གདུལ་བ་ལ་མངོན་དུ་གྱུར་པའོ། །དེ་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱས་པའོ།
en: How should a bodhisattva complete the bodhisattva perfections?

source: །དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་ས་ཐམས་ཅད་ལ་རབ་ཏུ་གནས་པའོ།
en: How should a bodhisattva enter the patience of a bodhisattva?

source: །དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་བཟོད་པ་ཐམས་ཅད་རབ་ཏུ་ཐོབ་པའོ། །དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པར་ཞུགས་པའོ། །དེ་ནི་ལུང་བསྟན་པ་ཐམས་ཅད་ཡང་དག་པར་བླང་བའོ། དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་བ་ཐམས་ཅད་ལ་རྣམ་པར་རྩེ་བའོ། །དེ་ནི་སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་ཐམས་ཅད་ཡོངས་སུ་བླང་བའོ། །དེ་ནི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱི་ཡུལ་ལ་དབང་བསྐུར་བས་མངོན་པར་དབང་བསྐུར་བའོ།
en: Noble one, the bodhisattva Maitreya has understood all bodhisattva conduct, he has comprehended the minds and thoughts of all beings, he has followed the conduct of all beings, he is focused on ripening and guiding all beings, he has completed all the perfections, he dwells on all the bodhisattva bhūmis, he has attained all the patience of a bodhisattva, he is free of the defects of a bodhisattva, he possesses all the prophecies of a bodhisattva, he delights in all the liberations of a bodhisattva, he has acquired all the blessings of the buddhas, and he has been empowered by the empowerment of the range of omniscience of all the tathāgatas.

source: །རིགས་ཀྱི་བུ་དགེ་བའི་བཤེས་གཉེན་དེ་ཁྱོད་ལ་དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཀྱིས་ནི་མངོན་པར་བརླན་པར་བྱེད་དོ། །བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་ནི་རྣམ་པར་འཕེལ་བར་བྱེད་དོ། །ལྷག་པའི་བསམ་པའི་དབྱིངས་ནི་རབ་ཏུ་བརྟན་པར་བྱེད་དོ། །དགེ་བའི་རྩ་བ་ཐམས་ཅད་ནི་ཤིན་ཏུ་བྱང་བར་བྱེད་དོ། །བྱང་ཆུབ་སེམས་དཔའི་དབང་པོའི་ཤུགས་ནི་ཡང་དག་པར་འཕེལ་བར་བྱེད་དོ། །ཆོས་ཀྱི་ཕྱོགས་བསྒྲིབས་པ་མེད་པ་ནི་ཡོངས་སུ་སྟོན་པར་བྱེད་དོ། །གཞི་ཀུན་ཏུ་ཟུག་པའི་ས་ཁོང་དུ་ཆུད་པར་བྱ་བ་ནི་རྟོགས་པར་བྱེད་དོ། །བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་སྨོན་ལམ་གྱི་སར་འབྱུང་བའི་སྒོ་ལ་ནི་གཞོག་པར་བྱེད་དོ། །བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་སྤྱོད་པ་དང་། སྨོན་ལམ་གྱི་ཡོན་ཏན་ཡོངས་སུ་གྲུབ་པ་ནི་ཡང་དག་པར་རྫོགས་པར་འགྱུར་རོ། །བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པ་ཐོབ་པར་བྱ་བའི་སྐྱེ་བའི་སྒོ་ནི་ཡོངས་སུ་སྟོན་པར་འགྱུར་གྱིས།
en: “Noble one, that kalyāṇamitra will saturate you with roots of merit, he will increase your aspiration for enlightenment, he will make the element of your superior aspiration stable, he will purify all your roots of merit, he will increase the force of your bodhisattva powers, he will reveal the unobscured direction of the Dharma, he will make you realize the understanding of all the bhūmis that are entered, he will make you enter the gateways to the arising of the prayers of all bodhisattvas, and he will show you the gateway to the arising of the attainment of the completely good bodhisattva conduct.

source: རིགས་ཀྱི་བུ་ཁྱོད་དགེ་བའི་རྩ་བ་གཅིག་ལ་ཆགས་པར་མ་བྱེད་ཅིག །ཆོས་ཀྱི་སྒོའི་འོད་སྣང་བ་གཅིག་ལ་གཞོལ་བར་མ་བྱེད་ཅིག །སྤྱོད་པ་གཅིག་ཡོངས་སུ་རྫོགས་པས་ཆོག་པར་མ་སེམས་ཤིག །སྨོན་ལམ་གཅིག་པུ་མངོན་པར་བསྒྲུབ་པ་ལྷུར་མ་ལེན་ཅིག །ལུང་བསྟན་པ་གཅིག་གིས་མཐར་ཐུག་པས་རྒྱུན་གཅད་པར་མ་བྱེད་ཅིག །བཟོད་པ་གསུམ་ལ་འཇུག་པས་ཆོག་པར་བྱ་བའི་འདུ་ཤེས་སུ་མ་བྱེད་ཅིག །ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོངས་སུ་རྫོགས་པར་བྱ་བ་རྒྱུན་མ་གཅོད་ཅིག །ས་བཅུ་ཐོབ་པས་མཐར་ཐུག་པར་མ་བྱེད་ཅིག །སངས་རྒྱས་ཀྱི་ཞིང་ཚད་ཡོད་པ་ཡོངས་སུ་གཟུང་བ་དང་། ཡོངས་སུ་དག་པར་བྱ་བ་མ་སྨོན་ཅིག །དགེ་བའི་བཤེས་གཉེན་ཚད་ཡོད་པ་དགའ་བར་བྱ་བ་དང་། བསྙེན་བཀུར་བས་ངོམས་པར་མ་བྱེད་ཅིག །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: “Noble one, do not be attached to one root of merit! Do not be devoted to one illumination from the light of a Dharma gateway! Do not be dedicated to accomplishing one prayer! Do not continuously follow through one prophecy! Do not have the perception that three kinds of patience are enough! Do not continually bring to completion six perfections! Do not make attaining ten bhūmis the ultimate goal! Do not aspire to possess and purify a measurable number of buddha realms! Do not be satisfied by rejoicing in and serving a measurable extent of kalyāṇamitras!

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔས་ནི་དགེ་བའི་རྩ་བ་ཚད་མེད་པ་ཡོངས་སུ་བསྡུ་བར་བྱ་དགོས་སོ།
en: “Why is that? Noble one, a bodhisattva must gather countless roots of merit;

source: །བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཚད་མེད་པ་ཤིན་ཏུ་བསྒྲུབ་དགོས་སོ།
en: must accomplish countless bodhisattva accumulations;

source: །བྱང་ཆུབ་སེམས་དཔའི་སེམས་ཀྱི་རྒྱུ་ཚད་མེད་པ་ཡོངས་སུ་བསྩགས་དགོས་སོ།
en: must gather countless causes of bodhisattva motivation;

source: །ཡོངས་སུ་བསྔོ་བའི་ཚུལ་ཚད་མེད་པ་ལ་བསླབ་པར་བྱ་དགོས་སོ། །སེམས་ཅན་གྱི་ཁམས་ཚད་མེད་པ་ཡོངས་སུ་སྨིན་པར་བྱ་དགོས་སོ།
en: must train in countless ways of dedication; must ripen countless realms of beings;

source: །སེམས་ཅན་གྱི་བསམ་པའི་ཁམས་ཚད་མེད་པ་ལ་འཇུག་པར་བྱ་དགོས་སོ།
en: must comprehend countless elements of thought in beings;

source: །སེམས་ཅན་གྱི་དབང་པོ་ཚད་མེད་པ་ཡོངས་སུ་ཤེས་པར་བྱ་དགོས་སོ།
en: must know countless faculties of beings;

source: །སེམས་ཅན་གྱི་མོས་པ་ཚད་མེད་པའི་རྗེས་སུ་འབྲང་བར་བྱ་དགོས་སོ།
en: must follow countless aspirations of beings;

source: །སེམས་ཅན་གྱི་སྤྱོད་པ་ཚད་མྱེད་པ་ཁོང་དུ་ཆུད་པར་བྱ་དགོས་སོ།
en: must comprehend countless conducts of beings;

source: །སེམས་ཅན་ཚད་མེད་པ་གདུལ་བར་བྱ་དགོས་སོ།
en: must guide countless beings;

source: །ཉོན་མོངས་པ་དང་བག་ལ་ཉལ་བ་ཚད་མེད་པ་ཡང་དག་པར་གཞོམ་དགོས་སོ།
en: must overcome countless kleśas and predispositions;

source: །ལས་ཀྱི་སྒྲིབ་པ་ཚད་མེད་པ་ཡོངས་སུ་སྦྱང་དགོས་སོ།
en: must purify countless obscurations from karma;

source: །ལྟ་བའི་རྣམ་པ་ཚད་མེད་པ་རྣམ་པར་བཟློག་དགོས་སོ།
en: must dispel countless wrong views;

source: །སེམས་ཀྱི་ཀུན་ནས་ཉོན་མོངས་པ་ཚད་མེད་པ་བསྩལ་བར་བྱ་དགོས་སོ།
en: must eliminate countless kleśas from the mind;

source: །སེམས་རྣམ་པར་དག་པ་ཚད་མེད་པ་བསྐྱེད་པར་བྱ་དགོས་སོ།
en: must generate countless purifications of the mind;

source: །སྡུག་བསྔལ་གྱི་ཟུག་རྔུ་ཚད་མེད་པ་ཡང་དག་པར་དབྱུང་དགོས་སོ།
en: must banish countless agonies from suffering;

source: །སྲིད་པའི་རྒྱ་མཚོ་ཚད་མེད་པ་ཡོངས་སུ་བསྐམ་པར་བྱ་དགོས་སོ།
en: must dry up countless oceans of existences;

source: །མ་རིག་པའི་མུན་པ་ཚད་མེད་པ་རྣམ་པར་བསལ་དགོས་སོ།
en: must dispel countless darknesses from ignorance;

source: །ང་རྒྱལ་གྱི་རི་ཚད་མེད་པ་རབ་ཏུ་བསྙིལ་དགོས་སོ།
en: must demolish countless mountains of pride;

source: །འཁོར་བའི་བཅིངས་པ་ཚད་མེད་པ་ཤིན་ཏུ་གཏུབ་དགོས་སོ།
en: must cut through countless bondages of saṃsāra;

source: །སྲིད་པའི་ཆུ་བོ་ཚད་མེད་པ་བརྒལ་དགོས་སོ།
en: must cross over countless rivers of existences;

source: །ཚེའི་རྒྱ་མཚོ་ཚད་མེད་པ་བསྐམ་དགོས་སོ།
en: must dry up countless oceans of rebirths;

source: །སེམས་ཅན་འདོད་པའི་འདམ་དུ་ཐོགས་པ་ཚད་མེད་པ་ཡོངས་སུ་དགྲོལ་དགོས་སོ།
en: must free countless beings stuck in the swamp of desire;

source: །སེམས་ཅན་ཁམས་གསུམ་གྱི་ཁྱིམ་དུ་ཐོགས་པ་ཚད་མེད་པ་གདོན་པར་བྱ་དགོས་སོ།
en: must bring out countless beings trapped in the mansion of the three realms;

source: །སེམས་ཅན་ཚད་མེད་པ་འཕགས་པའི་ལམ་ལ་དགོད་དགོས་སོ།
en: must bring countless beings onto the path of the āryas;

source: །འདོད་ཆགས་དང་ཞེ་སྡང་དང་གཏི་མུག་གི་སྤྱོད་པ་ཚད་མེད་པ་རབ་ཏུ་ཞི་བར་བྱ་དགོས་སོ།
en: must bring to an end countless conducts of desire, anger, and ignorance;

source: །བདུད་ཀྱི་ཞགས་པ་ཚད་མེད་པ་ལས་ཡང་དག་པར་འདའ་བར་བྱ་དགོས་སོ།
en: must pass beyond countless māra nooses;

source: །བདུད་ཀྱི་ལས་ཚད་མེད་པ་རྣམ་པར་བཟློག་དགོས་སོ།
en: must repel countless māra activities;

source: །བྱང་ཆུབ་སེམས་དཔའི་ལྷག་པའི་བསམ་པའི་ཁམས་ཚད་མྱེད་པ་ཡོངས་སུ་སྦྱང་དགོས་སོ།
en: must purify countless elements of the superior motivation of a bodhisattva;

source: །བྱང་ཆུབ་སེམས་དཔའི་སྦྱོར་བ་ཚད་མེད་པ་རྣམ་པར་འཕེལ་བར་བྱ་དགོས་སོ།
en: must increase countless bodhisattva conducts;

source: །བྱང་ཆུབ་སེམས་དཔའི་དབང་པོ་ཚད་མེད་པ་ཡོངས་སུ་བསྐྱེད་དགོས་སོ།
en: must generate countless bodhisattva powers;

source: །བྱང་ཆུབ་སེམས་དཔའི་མོས་པ་ཚད་མེད་པ་ཡོངས་སུ་སྦྱང་དགོས་སོ།
en: must purify countless bodhisattva aspirations;

source: །བྱང་ཆུབ་སེམས་དཔའི་མཉམ་པ་ཉིད་ཚད་མེད་པ་ལ་འཇུག་པར་བྱ་དགོས་སོ།
en: must enter countless bodhisattva equanimities;

source: །བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་ཁྱད་པར་ཚད་མེད་པའི་རྗེས་སུ་འབྲང་བར་བྱ་དགོས་སོ།
en: must follow countless particular qualities of bodhisattva conduct;

source: །བྱང་ཆུབ་སེམས་དཔའི་ཡོན་ཏན་ཚད་མེད་པ་ཡོངས་སུ་དག་པར་བྱ་དགོས་སོ།
en: must purify countless bodhisattva qualities;

source: །བྱང་ཆུབ་སེམས་དཔས་བྱ་བའི་སྤྱོད་པ་ཚད་མེད་པ་ཡོངས་སུ་རྫོགས་པར་བྱ་དགོས་སོ།
en: must complete countless bodhisattva conducts;

source: །འཇིག་རྟེན་གྱི་སྤྱོད་པ་ཚད་མེད་པའི་རྗེས་སུ་འབྲང་བར་བྱ་དགོས་སོ།
en: must conform with countless worldly conducts;

source: །འཇིག་རྟེན་གྱི་རྗེས་སུ་འབྲང་བ་ཚད་མེད་པ་ཡོངས་སུ་བསྟན་དགོས་སོ།
en: must manifest countless conformities with the world;

source: །དད་པའི་སྟོབས་ཚད་མེད་པ་ཡོངས་སུ་བསྐྱེད་དགོས་སོ།
en: must generate countless strengths of faith;

source: །བརྩོན་འགྲུས་ཀྱི་སྟོབས་ཚད་མེད་པ་ཉེ་བར་བརྟན་དགོས་སོ།
en: must make firm countless strengths of diligence;

source: །དྲན་པའི་སྟོབས་ཚད་མེད་པ་ཡོངས་སུ་དག་པར་བྱ་དགོས་སོ།
en: must purify countless strengths of memory;

source: །ཏིང་ངེ་འཛིན་གྱི་སྟོབས་ཚད་མེད་པ་ཡོངས་སུ་རྫོགས་པར་བྱ་དགོས་སོ།
en: must perfect countless strengths of samādhi;

source: །ཤེས་རབ་ཀྱི་སྟོབས་ཚད་མེད་པ་བསྐྱེད་པར་བྱ་དགོས་སོ།
en: must generate countless strengths of wisdom;

source: །མོས་པའི་སྟོབས་ཚད་མེད་པ་བརྟན་པར་བྱ་དགོས་སོ།
en: must make firm countless strengths of aspiration;

source: །བསོད་ནམས་ཀྱི་སྟོབས་ཚད་མེད་པ་ཡང་དག་པར་བསྒྲུབ་དགོས་སོ།
en: must accomplish countless strengths of merit;

source: །ཡེ་ཤེས་ཀྱི་སྟོབས་ཚད་མེད་པ་རྣམ་པར་སྤེལ་དགོས་སོ།
en: must increase countless strengths of knowledge;

source: །བྱང་ཆུབ་སེམས་དཔའི་སྟོབས་ཚད་མེད་པ་ཡང་དག་པར་བསྒྲུབ་དགོས་སོ།
en: must accomplish countless bodhisattva strengths;

source: །སངས་རྒྱས་ཀྱི་སྟོབས་ཚད་མེད་པ་ཡོངས་སུ་རྫོགས་པར་བྱ་དགོས་སོ།
en: must perfect countless buddha strengths;

source: །ཆོས་ཀྱི་སྒོ་ཚད་མེད་པ་རབ་ཏུ་དབྱེ་དགོས་སོ།
en: must open countless Dharma doors;

source: །ཆོས་ཀྱི་ཕྱོགས་ཚད་མེད་པ་ལ་འཇུག་པར་བྱ་དགོས་སོ། །ཆོས་ཀྱི་སྒོ་ཚད་མེད་པ་ཡོངས་སུ་སྦྱང་དགོས་སོ།
en: must enter countless Dharma directions;

source: །ཆོས་ཀྱི་སྣང་བ་ཚད་མེད་པ་ཡང་དག་པར་བསྐྱེད་དགོས་སོ།
en: must generate countless Dharma lights;

source: །ཆོས་ཀྱི་གསལ་བ་ཚད་མེད་པར་རབ་ཏུ་བྱ་དགོས་སོ།
en: must create countless Dharma illuminations;

source: །དབང་པོའི་རྒྱུད་ཚད་མེད་པ་སྣང་བར་བྱ་དགོས་སོ།
en: must illuminate countless classes of powers;

source: །ཉོན་མོངས་པའི་ནད་ཚད་མེད་པ་ཡོངས་སུ་ཤེས་པར་བྱ་དགོས་སོ།
en: must know countless kleśa illnesses;

source: །ཆོས་ཀྱི་སྨན་ཚད་མེད་པ་ཡང་དག་པར་བསྡུ་དགོས་སོ།
en: must gather countless Dharma medicines;

source: །ཉོན་མོངས་པའི་ནད་ཀྱིས་བཏབ་པའི་སེམས་ཅན་གྱི་ཁམས་ཚད་མེད་པ་གསོ་དགོས་སོ།
en: must heal countless elements of beings afflicted by kleśa illnesses;

source: །བདུད་རྩིའི་ཚོགས་ཚད་མེད་པ་ཡང་དག་པར་བསྡུ་བར་བྱ་དགོས་སོ།
en: must gather countless accumulations of amrita;

source: །སངས་རྒྱས་ཀྱི་ཞིང་ཚད་མེད་པ་འདའ་བར་བྱ་དགོས་སོ།
en: must reach countless buddha realms;

source: །དེ་བཞིན་གཤེགས་པ་ཚད་མེད་པ་མཆོད་དགོས་སོ།
en: must make offerings to countless tathāgatas;

source: །བྱང་ཆུབ་སེམས་དཔའི་འཁོར་གྱི་དཀྱིལ་འཁོར་ཚད་མེད་པར་འཇུག་པར་བྱ་དགོས་སོ།
en: must enter countless bodhisattva assemblies of followers;

source: །དེ་བཞིན་གཤེགས་པའི་བསྟན་པ་ཚད་མེད་པ་ཡོངས་སུ་གཟུང་དགོས་སོ།
en: must obtain countless teachings from tathāgatas;

source: །སེམས་ཅན་གྱི་གནོད་པ་ཚད་མེད་པ་བཟོད་པར་བྱ་དགོས་སོ།
en: must have patience for countless harms from beings;

source: །མི་ཁོམ་པ་དང་ངན་སོང་གི་ལམ་ཚད་མེད་པ་ཡོངས་སུ་གཅད་དགོས་སོ།
en: must eliminate countless unfortunate existences and lower existences;

source: །སེམས་ཅན་གྱི་བདེ་བ་ཚད་མེད་པ་ཉེ་བར་བསྒྲུབ་དགོས་སོ།
en: must accomplish countless happinesses for beings;

source: །སེམས་ཅན་བསྡུ་བ་ཚད་མེད་པ་བྱ་དགོས་སོ།
en: must accomplish countless gatherings of beings;

source: །གཟུངས་ཀྱི་སྒོ་ཚད་མེད་པ་ཡོངས་སུ་སྦྱང་དགོས་སོ།
en: must purify countless gateways to the power of retention;

source: །སྨོན་ལམ་གྱི་སྒོ་ཚད་མེད་པ་མངོན་པར་བསྒྲུབ་དགོས་སོ།
en: must accomplish countless gateways to prayer;

source: །བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོའི་སྟོབས་ཚད་མེད་པ་ཡོངས་སུ་བསྒོམ་དགོས་སོ།
en: must meditate on countless strengths of great love and great compassion;

source: །ཆོས་ཡོངས་སུ་བཙལ་བ་ལ་བརྩོན་པར་བྱ་བ་ཚད་མེད་པ་རྒྱུན་མི་གཅད་པར་བྱ་དགོས་སོ།
en: must have continuous, countless dedications to searching for the Dharma;

source: །ངེས་པར་རྟོགས་པའི་སྟོབས་ཚད་མྱེད་པའི་རྗེས་སུ་འཇུག་དགོས་སོ།
en: must gain countless strengths of certainty;

source: །མངོན་པར་ཤེས་པ་མངོན་དུ་བསྒྲུབ་པ་ཚད་མེད་པ་བསྐྱེད་དགོས་སོ།
en: must generate countless accomplishments of higher cognitions;

source: །རིག་པ་དང་ཡེ་ཤེས་ཀྱི་སྣང་བ་ཚད་མེད་པ་རྣམ་པར་དག་པར་བྱ་དགོས་སོ།
en: must purify countless lights of insight and knowledge;

source: །སེམས་ཅན་གྱི་རྒྱུད་ཚད་མེད་པའི་རྗེས་སུ་འགྲོ་བར་བྱ་དགོས་སོ།
en: must be in conformity with countless classes of beings;

source: །སྲིད་པར་སྐྱེ་བ་ཚད་མེད་པ་ཡོངས་སུ་གཟུང་དགོས་སོ།
en: must take countless births in existences;

source: །ལུས་རྣམ་པར་ཕྱེ་བ་ཚད་མེད་པ་ཡོངས་སུ་བསྟན་དགོས་སོ།
en: must manifest countless categories of bodies;

source: །སྐད་རྣམ་པར་ཕྱེ་བ་ཚད་མེད་པ་ཡོངས་སུ་ཤེས་པར་བྱ་དགོས་སོ།
en: must know countless categories of languages;

source: །སེམས་ཅན་གྱི་སེམས་རྣམ་པ་ཐ་དད་པ་ཚད་མེད་པ་ཁོང་དུ་ཆུད་པར་བྱ་དགོས་སོ།
en: must comprehend countless different kinds of minds of beings;

source: །བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་ཡུལ་རྒྱ་ཆེན་པོའི་རྗེས་སུ་འཇུག་པར་བྱ་དགོས་སོ།
en: must enter into the vast bodhisattva range of activity;

source: །བྱང་ཆུབ་སེམས་དཔའི་གནས་ཤིན་ཏུ་ཡངས་པར་རྗེས་སུ་སྤྱད་དགོས་སོ།
en: must perform conduct in the extensive bodhisattva locations;

source: །བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་སྤྱོད་པ་ཟབ་མོ་ལ་རྣམ་པར་བལྟ་དགོས་སོ།
en: must look at profound bodhisattva conduct;

source: །བྱང་ཆུབ་སེམས་དཔའི་ཡུལ་རྟོགས་པར་དཀའ་བ་ཁོང་དུ་ཆུད་པར་བྱ་དགོས་སོ།
en: must comprehend the bodhisattva scope of perception that is difficult to understand;

source: །བྱང་ཆུབ་སེམས་དཔའི་ལམ་བགྲོད་པར་དཀའ་བ་བགྲོད་པར་བྱ་དགོས་སོ།
en: must follow on the bodhisattva path that is difficult to follow;

source: །བྱང་ཆུབ་སེམས་དཔའི་ཤུགས་བསྒྲུབ་པར་དཀའ་བ་ཡོངས་སུ་གཟུང་དགོས་སོ།
en: must gain the bodhisattva power that is difficult to accomplish;

source: །བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པ་འཇུག་པར་དཀའ་བ་ལ་འཇུག་པར་བྱ་དགོས་སོ།
en: must gain bodhisattva faultlessness that is difficult to gain;

source: །བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་རྣམ་པ་སྣ་ཚོགས་ཁོང་དུ་ཆུད་པར་བྱ་དགོས་སོ།
en: must comprehend the variety of bodhisattva conducts;

source: །བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་འཕྲུལ་པ་ཐམས་ཅད་དུ་ཁྱབ་པ་ཀུན་ཏུ་བསྟན་དགོས་སོ།
en: and must manifest all-pervading bodhisattva miraculous manifestations.

source: །བྱང་ཆུབ་སེམས་དཔའི་ཆོས་ཀྱི་སྤྲིན་ཡོངས་སུ་གཟུང་དགོས་སོ། །བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་དྲ་བ་མཐའ་དང་དབུས་མེད་པར་རབ་ཏུ་རྒྱས་པར་བྱ་དགོས་སོ།
en: A bodhisattva must obtain the clouds of the Dharma and must expand the vast extent, without end or middle, of bodhisattva conduct.

source: །བྱང་ཆུབ་སེམས་དཔས་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱ་དགོས་སོ།
en: A bodhisattva must complete all the perfections;

source: །བྱང་ཆུབ་སེམས་དཔས་ལུང་བསྟན་པ་ཚད་མེད་པར་ཡང་དག་པར་མནོད་དགོས་སོ།
en: a bodhisattva must acquire countless prophecies;

source: །བྱང་ཆུབ་སེམས་དཔས་བཟོད་པའི་སྒོ་དཔག་ཏུ་མེད་པ་ལ་འཇུག་པར་བྱ་དགོས་སོ།
en: a bodhisattva must enter an incalculable number of gateways into patience;

source: །བྱང་ཆུབ་སེམས་དཔས་གྲགས་མྱེད་པ་ཡོངས་སུ་སྦྱང་བར་བྱ་དགོས་སོ།
en: a bodhisattva must purify innumerable bhūmis;

source: །བྱང་ཆུབ་སེམས་དཔས་ཆོས་ཀྱི་སྒོ་དཔག་ཏུ་མེད་པ་ཡོངས་སུ་དག་པར་བྱ་དགོས་སོ།
en: a bodhisattva must make pure a countless number of gateways to the Dharma;

source: །བྱང་ཆུབ་སེམས་དཔས་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པ་ཡོངས་སུ་སྦྱང་དགོས་སོ།
en: a bodhisattva must purify an indescribable number of buddha realms;

source: །བྱང་ཆུབ་སེམས་དཔས་བསྐལ་པ་མཐའ་ཡས་པར་གོ་ཆ་བགོ་དགོས་སོ།
en: a bodhisattva must put on the armor for remaining throughout endless kalpas;

source: །བྱང་ཆུབ་སེམས་དཔས་དེ་བཞིན་གཤེགས་པ་དཔག་ཏུ་མེད་པ་མཆོད་པར་བྱ་དགོས་སོ།
en: a bodhisattva must make offerings to countless tathāgatas;

source: །བྱང་ཆུབ་སེམས་དཔས་སྨོན་ལམ་མངོན་པར་བསྒྲུབ་པ་བསམ་གྱིས་མི་ཁྱབ་པར་མངོན་པར་བསྒྲུབ་དགོས་སོ།
en: and a bodhisattva must accomplish an inconceivable number of accomplished prayers.

source: །རིགས་ཀྱི་བུ་མདོར་ན་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱེད་པས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྤྱོད་པ་ནི་སེམས་ཅན་ཐམས་ཅད་དང་མཉམ་པར་བསྟན་ཏོ།
en: “Noble one, in brief, bodhisattva conduct manifests equally to all beings because it ripens all beings;

source: །བསྐལ་པ་ཐམས་ཅད་དུ་གནས་པས་བསྐལ་པ་ཐམས་ཅད་དང་མཉམ་པར་བསྟན་ཏོ།
en: it manifests equally in all kalpas because it remains throughout all kalpas;

source: །ཐམས་ཅད་དུ་སྐྱེ་བ་ཡོངས་སུ་སྟོན་པས་སྐྱེ་བ་ཐམས་ཅད་དང་མཉམ་པར་བསྟན་ཏོ།
en: it manifests equally in all births because it manifests births everywhere;

source: །དུས་གསུམ་གྱི་ཡེ་ཤེས་ཁོང་དུ་ཆུད་པར་བྱ་བའི་ཕྱིར་དུས་ཐམས་ཅད་དང་མཉམ་པར་བསྟན་ཏོ།
en: it manifests equally in all times because of the realization of the knowledge of the three times;
